/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "Anslutningen stängdes av fjärrdatorn";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "Försöket att ansluta till värden tog för lång tid";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "Försöket att skapa socket från socket FD misslyckades. getpeername() misslyckades";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "Inläsningen nådde maximal längd";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "Inläsningen tog för lång tid";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "Skrivningen tog för lång tid";

